data = {
    "Общая": {
        (10, 11): {
            "girls": {
                range(0, 34): "Стена 1",
                range(34, 41): "Стена 2",
                range(41, 49): "Стена 3",
                range(49, 56): "Стена 4",
                range(56, 63): "Стена 5",
                range(63, 71): "Стена 6",
                range(71, 78): "Стена 7",
                range(78, 85): "Стена 8",
                range(85, 93): "Стена 9",
                range(93, 150): "Стена 10"},
            "boys": {
                range(0, 27): "Стена 1",
                range(27, 33): "Стена 2",
                range(33, 40): "Стена 3",
                range(40, 46): "Стена 4",
                range(46, 53): "Стена 5",
                range(53, 59): "Стена 6",
                range(59, 66): "Стена 7",
                range(66, 72): "Стена 8",
                range(72, 78): "Стена 9",
                range(78, 150): "Стена 10"}
        },
        (12): {
            "girls": {
                range(0, 35): "Стена 1",
                range(35, 41): "Стена 2",
                range(44, 51): "Стена 3",
                range(51, 59): "Стена 4",
                range(59, 67): "Стена 5",
                range(67, 75): "Стена 6",
                range(75, 82): "Стена 7",
                range(82, 90): "Стена 8",
                range(90, 98): "Стена 9",
                range(98, 150): "Стена 10"},
            "boys": {
                range(0, 27): "Стена 1",
                range(27, 33): "Стена 2",
                range(33, 39): "Стена 3",
                range(39, 45): "Стена 4",
                range(45, 51): "Стена 5",
                range(51, 57): "Стена 6",
                range(57, 63): "Стена 7",
                range(63, 68): "Стена 8",
                range(68, 74): "Стена 9",
                range(74, 150): "Стена 10"}
        },
        (13, 14): {
            "girls": {
                range(0, 35): "Стена 1",
                range(35, 44): "Стена 2",
                range(44, 53): "Стена 3",
                range(53, 62): "Стена 4",
                range(62, 71): "Стена 5",
                range(71, 81): "Стена 6",
                range(81, 89): "Стена 7",
                range(89, 99): "Стена 8",
                range(99, 108): "Стена 9",
                range(108, 150): "Стена 10"},
            "boys": {
                range(0, 38): "Стена 1",
                range(38, 46): "Стена 2",
                range(46, 54): "Стена 3",
                range(54, 62): "Стена 4",
                range(62, 70): "Стена 5",
                range(70, 78): "Стена 6",
                range(78, 86): "Стена 7",
                range(86, 94): "Стена 8",
                range(94, 102): "Стена 9",
                range(102, 150): "Стена 10"}
        },
        (15, 16): {
            "girls": {
                range(0, 34): "Стена 1",
                range(34, 40): "Стена 2",
                range(40, 47): "Стена 3",
                range(47, 54): "Стена 4",
                range(54, 61): "Стена 5",
                range(61, 68): "Стена 6",
                range(68, 75): "Стена 7",
                range(75, 81): "Стена 8",
                range(81, 88): "Стена 9",
                range(88, 150): "Стена 10"},
            "boys": {
                range(0, 28): "Стена 1",
                range(28, 35): "Стена 2",
                range(35, 42): "Стена 3",
                range(42, 48): "Стена 4",
                range(48, 55): "Стена 5",
                range(55, 62): "Стена 6",
                range(62, 69): "Стена 7",
                range(69, 76): "Стена 8",
                range(76, 83): "Стена 9",
                range(83, 150): "Стена 10"}
        }
    },
    "Школьная": {

    },
    "Самооценочная": {

    },
    "Межличностная": {

    },
    "N": {}
}
